In [1]:
import pandas as pd

In [2]:
!pip install xlrd

Collecting xlrd
  Downloading xlrd-2.0.1-py2.py3-none-any.whl.metadata (3.4 kB)
Downloading xlrd-2.0.1-py2.py3-none-any.whl (96 kB)
Installing collected packages: xlrd
Successfully installed xlrd-2.0.1

In [4]:
!pip install openpyxl

Collecting openpyxl
  Using cached openpyxl-3.1.5-py2.py3-none-any.whl.metadata (2.5 kB)
Collecting et-xmlfile (from openpyxl)
  Using cached et_xmlfile-2.0.0-py3-none-any.whl.metadata (2.7 kB)
Using cached openpyxl-3.1.5-py2.py3-none-any.whl (250 kB)
Using cached et_xmlfile-2.0.0-py3-none-any.whl (18 kB)
Installing collected packages: et-xmlfile, openpyxl
Successfully installed et-xmlfile-2.0.0 openpyxl-3.1.5

In [5]:
df=pd.read_excel('emp.xlsx')

In [6]:
df

   empid     ename    sal  address
0     10    sreeja  20000  chennai
1     11     rupsa  22000     pune
2     12  sreemoye  23000      hyd
3     13   amitava  15000  kolkata
4     14   sreejoy  22000    jammu

In [7]:
df=pd.read_excel('emp.xlsx')

In [8]:
df

   empid     ename    sal  address
0     10    sreeja  20000  chennai
1     11     rupsa  22000     pune
2     12  sreemoye  23000      hyd
3     13   amitava  15000  kolkata
4     14   sreejoy  22000    jammu
5     15    shreya  20000    delhi

In [9]:
df=pd.read_csv('emp2.csv')

In [10]:
df

   empid     ename    sal  address
0     10    sreeja  20000  chennai
1     11     rupsa  22000     pune
2     12  sreemoye  23000      hyd
3     13   amitava  15000  kolkata
4     14   sreejoy  22000    jammu

In [12]:
empdata={
    "empid":[1,2,3,4],
    "ename":['a','b','c','d'],
    "sal":[2000,3000,1000,4000],
    "address":["kol","che","del","pun"]
}

In [13]:
empdata

{'empid': [1, 2, 3, 4],
 'ename': ['a', 'b', 'c', 'd'],
 'sal': [2000, 3000, 1000, 4000],
 'address': ['kol', 'che', 'del', 'pun']}

In [14]:
df=pd.DataFrame(empdata)

In [15]:
df

   empid ename   sal address
0      1     a  2000     kol
1      2     b  3000     che
2      3     c  1000     del
3      4     d  4000     pun

In [16]:
empdata=[
    (1,'a',2000,'kol'),
    (11,'aa',3000,'kol2'),
    (111,'aaa',4000,'kol3'),
    (1111,'aaaa',5000,'kol4')
]

In [17]:
empdata

[(1, 'a', 2000, 'kol'),
 (11, 'aa', 3000, 'kol2'),
 (111, 'aaa', 4000, 'kol3'),
 (1111, 'aaaa', 5000, 'kol4')]